//Cracked by Roath
inherit NPC_SAVE;
string *title=({"ĞéÈÕĞÇ¾ı",
		"¶·Ä¾ĞÇ¾ı",
		"Å®ÍÁĞÇ¾ı",
		"Å£½ğĞÇ¾ı",
		"±ÚË®ĞÇ¾ı",
		"ÊÒ»ğĞÇ¾ı",
		"Î£ÔÂĞÇ¾ı",
		"°ºÈÕĞÇ¾ı",
		"¿üÄ¾ĞÇ¾ı",
		"Î¸ÍÁĞÇ¾ı",
		"Â¦½ğĞÇ¾ı",
		"²ÎË®ĞÇ¾ı",
		"õş»ğĞÇ¾ı",
		"±ÏÔÂĞÇ¾ı",
		"ĞÇÈÕĞÇ¾ı",
		"¾®Ä¾ĞÇ¾ı",
		"ÁøÍÁĞÇ¾ı",
		"¹í½ğĞÇ¾ı",
		"éôË®ĞÇ¾ı",
		"Òí»ğĞÇ¾ı",
		"ÕÅÔÂĞÇ¾ı",
		"·¿ÈÕĞÇ¾ı",
		"½ÇÄ¾ĞÇ¾ı",
		"ØµÍÁĞÇ¾ı",
		"¿º½ğĞÇ¾ı",
		"»şË®ĞÇ¾ı",
		"Î²»ğĞÇ¾ı",
		"ĞÄÔÂĞÇ¾ı",
});

string *long=({
"ÃæÈçÀ¶µâ¶àÍşÎä£¬³à·¢½ğ¾¦¶ñÈç»¢\nºô·ç»½Óê²»Ñ°³££¬Õ¶½«·âÎªĞéÈÕÊó\n", 
"¾ÅÑïÉ´½íÍ·ÉÏ¸Ç£¬¸¹ÄÚĞş»úÎŞ±ÈÈü\n½µÁú·ü»¢ËÆÆ½³££¬Õ¶½«·âÎª¶·Ä¾õô\n",
"¿ç»¢µÇÉ½¹Ûº×Â¹£¬ÇıĞ°×½¹ÖÉñ¹í¿Ş\nÖ»ÒòÎŞ¸£ÁËÏÉ¼Ò£¬Õ¶½«·âÎªÅ®ÍÁòğ\n",
"ÎåÔÀÈıÉ½ÈÎÒâÓÎ£¬·ÃĞş²ÎµÀÊØĞÄĞŞ\n¿ÕÀÍÂ¯ÄÚ½ğµ¤¹¯£¬Õ¶½«·âÎªÅ£½ğÅ£\n",
"ÎåĞĞÃîÊõÌåÈ«Êâ£¬ºÏ¾ÍĞşÖĞ×ÔÕÉ·ò\nÎòµÀ³ÉÏÉÎŞÔì»¯£¬Õ¶½«·âÎª±ÌË®áü\n",
"½Ø½Ì´«À´×ªÓñÊà£¬Ğş»úÁ½¼ÇÓÃ¹¦·ò\nµ¤É°¶¦ÄÚÁú½µ»¢£¬Õ¶½«·âÎªÊÒ»ğÖí\n",
"·¢ËÆÖìÉ°Á³ËÆµå£¬»ëÉíÉÏÏÂ½ğ¹âÏÖ\nÌì»úĞşÃî×ÜĞİÑÔ£¬Õ¶½«·âÎªÎ£ÔÂÑà\n",
"ÌúÊ÷¿ª»¨ÔõµÃÆë£¬ÒõÉñĞĞÀÖ¿çºçÄŞ\nÖ»ÒòÎŞ¸£ÎªÏÉÂÂ£¬Õ¶½«·âÎª°ºÈÕ¼¦\n",
"ÈıÁø¸ÖĞëÒ»³ß³¤£¬Á¶¾ÍÈı»¨²»ÀÏ·½\nÅîÀ³ÏÉµºÎŞĞÄÁµ£¬Õ¶½«·âÎª¿üÄ¾ÀÇ\n",
"¶¥ÉÏÏê¹âÎå²ÊÆø£¬°üÂŞÍòÏó¶àÁæÀş\nÎŞ·ÖÎŞÔµ³ÉÕı¹û£¬Õ¶½«·âÎªÎ¸ÍÁïô\n",
"ÀëÁú¿²»¢ÏàÆ¥Óö£¬Á¶¾ÍÉñµ¤³É²»Ğà\nÎŞÔµ¶¥ÉÏÏÖÈı»¨£¬Õ¶½«·âÎªÂ¦½ğ¹·\n",
"³öÊÀò¯³ÏÎòµÀÑÔ£¬ÇÚĞŞ¿àÁ¶·´Àë»ê\nÒÆÉ½µ¹º£ÈÎÎáÒâ£¬Õ¶½«·âÎª²ÎË®Ô³\n",
"²»Áµ³¾»ªÖ¹×ÔĞŞ£¬½µÁú·ü»¢ÈÎÓÆÓÎ\n¿ÕÎªÊıÔØµ¤É°Á¦£¬Õ¶½«·âÎªõş»ğºï\n",
"µÀÊõ¾«Ææ¸ÇÊÀÎŞ£¬ĞŞÕæÁ¶ĞÔÎÕ±ø·û\n³¤ÉúÃî¾÷Ì°³¾½Ù£¬Õ¶½«·âÎª±ÏÔÂÎÚ\n",
"ĞŞ³É´óµÀÕæäìÈ÷£¬Ãî·¨Ğş»úÓĞÕæ¼Ù\n²»ÄÜ³ÉÏÉÈ´·²³¾£¬Õ¶½«·âÎªĞÇÈÕÂí\n",
"ĞŞ³ÉµÀÆø¾«¹â»À£¬¾Ş¿Úâ²ÑÀºì·¢ÂÒ\n±ÌÓÎ¹¬ÄÚÓĞÉùÃû£¬Õ¶½«·âÎª¾®Ä¾áí\n",
"²ÉÁ·ÒõÑôÓĞÒì·½£¬ÎåĞĞ×«´ØÅäÖĞ»Æ\n²»¹é²û½Ì¹é½Ø½Ì£¬Õ¶½«·âÎªÁøÍÁâ¯\n",
"¸¹ÄÚÖéçá¹á°Ë·½£¬°üÂŞÍòÏóµÀÍôÑó\nÖ»ÒòÉ±½äÄÑÌÓ¶ã£¬Õ¶½«·âÎª¹í½ğÑò\n",
"óè¹ÚµÀ·şĞÔ´ÏÃô£¬Á¶¾Í°×ÆøÎŞĞÄËğ\nÖ»ÒòÎŞ¸£ÁË³¤Éú£¬Õ¶½«·âÎªéôË®ò¾\n",
"ÃØÊÚ¿Ú¾÷·üÑıĞ°£¬¶¥ÉÏÁéÔÆÌìµØÕÚ\nÈı»¨¾Û¶¥ÄÑ³É¾Í£¬Õ¶½«·âÎªÒí»ğÉß\n",
"¸¹ÄÚĞş»úĞŞ¶şÁù£¬Á¶¾ÍÒõÑô³¬·²Ë×\nË­ÖªÎŞÆøÎ´³¯Ôª£¬Õ¶½«·âÎªÕÅÔÂÂ¹\n",
"ÈıÃÁÕæ»ğ¿ÕÖĞÂ¶£¬Ï¼¹âÇ°ºóÉú°Ù²½\nÍòÏÉÕóÄÚ³ÑÓ¢ĞÛ£¬Õ¶½«·âÎª·¿ÈÕÍÃ\n",
"Ò»×ÖÇàÉ´ÄÔºóÆ®£¬µÀÅÛË®ºÏÊøË¿ÌĞ\nÔ­ÉñÒ»ÏÖÉñ¹êÃğ£¬Õ¶½«·âÎª½ÇÄ¾½Æ\n",
"³à·¢ºìĞëĞÔÇé¶í£¬ÓÎ¾¡ÈıÉ½²¢ÎåÔÀ\n°üÂŞÍòÏóÍ÷Í½ÀÍ£¬Õ¶½«·âÎªÊÏÍÁáó\n",
"½ğµ¤Á¶¾ÍÍÑ·®Áı£¬Îå¶İÈı³ı´óµÀÍ¨\nÎ´ÃğÈıÊ¬ÍÌÁùÆø£¬Õ¶½«·âÎª¿º½ğÁú\n",
"×Ô´ÓĞŞÁ¶ĞşÖĞÃî£¬²»Áµ½ğÕÂ¹²×ÏÚ¾\nÍ¨Ìì½ÌÖ÷ÊÇÎáÊ¦£¬Õ¶½«·âÎª»şË®±ª\n",
"±ÌÓñÏ¼¹ÚĞÎÈİ¹Å£¬Ë«ÊÖÉÆ°ÑÌìµØ²¹\nÎŞĞÄ·ÃµÀÑ§³¤Éú£¬Õ¶½«·âÎªÎ²»ğ»¢\n",
"ÃæÈç³àÔæÂäÈùºú£¬Èö¶¹³ÉÔÀ¸ÇÊÀÎŞ\nÁ½×ãµÇÔÆÈçÖ¿µç£¬Õ¶½«·âÎªĞÄÔÂºü\n",
});

void create()
{
	string tt, ll;
	tt = title[ID];
	ll = long[ID];

        set_name("ĞÇ¾ı", ({"xing jun", "star"}));
	set("title", tt);
	set("long", ll);
	set("gender", "ÄĞĞÔ");
	set("class", "xian");
	set("age", 20);
	set("per", 30);
	set("no_check", 1);	
	set("combat_exp", 1000000);
	set("daoxing", 1000000);

	setup();
	carry_object("/d/obj/cloth/xianpao")->wear();
	reload("star"+ID);
}

void init()
{
	object ob;
	ob=this_player();
	::init();
	
	if( wizardp(ob) && !this_object()->query("have_name") ){
		tell_object(ob,"Èç¹û´ËĞÇ¾ıÉĞÎ´ÃüÃû£¬ÇëÓÃ(setname ĞÕÃû)¡£\n");
	}
	add_action("setname", "setname");
	return;
}

int setname(string arg)
{
	object ob;
	ob=this_player();

	if(!wizardp(ob))
		return notify_fail("Ê²Ã´£¿\n");

	if(!arg)
		return notify_fail("ÇëÓÃ(setname ĞÕÃû)¡£\n");

	tell_object(ob, "ĞÕÃû¸Ä¶¯³É¹¦¡£\n");
	this_object()->set("have_name", 1);
	this_object()->set("name", arg);
	this_object()->save();
	return 1;
}
