［比丘国］

                  酒楼    街坊－街坊－街坊－金亭馆                  
                    ＼    ／           ｜ ＼
                      街坊－宅院      彩铺  街坊－街坊－峒门－林道
                       ｜    ｜               ｜                  ＼
                阋门－街坊－宅院             街坊                   林道－
              ／       ｜                   ／                        ※盘丝岭※
  －林道－林道        街坊                街坊－牛肉馆  
 ※无底洞※          ／   ＼                ＼
                   小子场   金器店    佛道场－街坊  
                     ｜                         ＼
        宝殿－大殿－朝门                        街坊
         ｜         ／                           ｜
        玉殿      官场                          曩门  
                                              ／
                                            林道
                                             ｜
                                           林道
                                           ／
                                        林道
                                         ｜
                                     ※※※※※
                                     ※清华庄※
                                     ※※※※※

［清华庄］
                            ｜
                          柳林坡－柳林坡
                                   ／
                                 柳林坡
                                     ＼
                                     柳林坡
                                       ｜
                                      溪北
                                    ～～～～
                                      溪南    
                                     ／
                        杨树－杨树－清华庄－茅屋
                           ＼／  ＼        ／
                           杨树－杨树－杨树

                               ※※※※※
                               ※清华洞※
                               ※※※※※
[雪豹1997.11]

