［小西天］

                 林道－林道       林道－林道－林道－林道
               ／       ｜      ／                      ＼
     林道－林道        林道－林道                     ※祭赛国※
   ／                   ＼
 ※朱紫国※              林道
                           ＼
                         ※※※※※※
                         ※小雷音寺※
                         ※※※※※※

［小雷音寺］

             ＼
               寺门     珍楼
                ｜       ｜    
               寺院－大雄宝殿－后殿
             ／          ｜
           菜园         宝阁
            ｜
           禅房

[雪豹1997.12]

