［乌鸡国］

  ※※※※
  ※皇宫※
  ※※※※         
     ｜            书房
     ｜          ／ ｜
   乾元街－太子府－后院－马槽                 ※平顶山※
     ｜             ｜                        ／
     ｜            寝宫                      山道    ※※※※※ 
   乾元街                                   ／       ※宝林寺※       
     ｜                                   山道       ※※※※※ 
     ｜                                  ／              ｜  ＼
  乾坤广场－坤元街－坤元街－东门－官道－山脚→山路      山路－山路   
              ｜      ｜                ／       ＼      ↓       ＼
             客栈   水果店      山道－山道        山路→山路  山路→山路
              ‖               ／                        ↓
           二楼客房           山道                      山顶
                             ／
                           ※车迟国※

皇宫：  

                             御花园
                               ｜
             祈雨坛 紫云宫－白玉回廊    
               ｜            ｜
    后宰门－－锦香亭－－白玉回廊
      ｜                    ｜
  宫墙外围                昭泽殿
      ｜                    ｜
  宫墙外围－－宫墙外围－－正阳门
                            △

金林寺：

                                   后院
                                    ｜
                西厢房－大雄宝殿－东厢房
                           ｜
                          前殿
                           ｜
                         金林寺
                           △

