//Descriptions for camera.c
//Crab, Dec 17, 1996

string *per_msg_male1 = ({
        CYN "英俊潇洒,风度翩翩。\n" NOR,
        CYN "相貌出众,面目俊朗。\n" NOR,
});

string *per_msg_male2 = ({
        CYN "英俊潇洒,风度翩翩。\n" NOR,
        CYN "相貌出众,面目俊朗。\n" NOR,
});
string *per_msg_male3 = ({
        CYN "相貌平平，没什麽好看的。\n" NOR,
        CYN "长得蔫蔫的，一副无精打采的模样。 \n" NOR,
        CYN "相貌凶恶，满脸横肉。\n" NOR
});
string *per_msg_female1 = ({
        CYN "容色秀丽，风姿绰约。 \n" NOR,
        CYN "长发如云，肌肤胜雪，不知倾倒了多少英雄豪杰。 \n" NOR,
        CYN "俏脸生春，妙目含情，轻轻一笑，不觉让人怦然心动。 \n" NOR,
        CYN "风情万种，楚楚动人，当真是我见犹怜。 \n" NOR,
});
                
string *per_msg_female2 = ({
        CYN "容色秀丽，风姿绰约。 \n" NOR,
        CYN "长发如云，肌肤胜雪，不知倾倒了多少英雄豪杰。 \n" NOR,
        CYN "俏脸生春，妙目含情，轻轻一笑，不觉让人怦然心动。 \n" NOR,
        CYN "风情万种，楚楚动人，当真是我见犹怜。 \n" NOR,
});

string *per_msg_female3 = ({
        CYN "虽算不上绝世佳人，也颇有几份姿色。 \n" NOR,
        CYN "长得还不错，颇有几份姿色。  \n" NOR,
});

              
string *msg_expression = ({
	"脸上露出愉快的微笑。",
	"躲在一边幸灾乐祸地笑。",
    "脸上露出狡诈的神情，大概又想到了什么坏主意了。",
	"绷着个脸扮酷。",
	"捧着肚子笑得前仰后合。",
	"眉头紧锁，不知在想什么心事。",
	"托着腮帮子作沉思状。",
	"咬牙切齿，一副愤愤不平的样子。",
	"一脸的迷茫，不知道周围发生了什么事。",
	"咧着嘴傻乐。",
	"作天真状。",
	"闷闷不乐。",
	"骄傲地昂着头，满脸不屑的神情。",
	"痛苦得呲牙咧嘴，大概是牙痛得厉害。",
	"强颜欢笑，但掩饰不住心里的哀伤。",
	"眉飞色舞。",
	"一脸的尴尬相。",
	"脸上露出灿烂的笑容。",
	"笑得比哭还难看。",
	"强忍着不让自己哭出来。",
	"媚眼如丝。",
	"作小鸟依人状。",
	"开怀大笑，露出满嘴的金牙。",
});

#define EXP_NUM	sizeof(msg_expression)
