
// story:zagang.c

#include <ansi.h>

int give_gift();

private mixed *story = ({
        "唐僧：徒儿，这里是个什么去处？真是太~~~~~好看啦！ ",
        "悟空：师傅，离开东土大唐已经好几年了，你怎么还是这个样子？一座石头山而已，有什么
		好看的？说你是土鳖，又怕观音姐姐骂我，在这座山上随便找一块石头都比你有见识！像你这
		样怎么罩的住大家？我们好赖也会一点法术，就连你骑的那匹马也一下子就把你踢翻了，你除
		了没完没了的给我们找麻烦，拜托你也学一点别的本事！",
        "唐僧：靠！我只不过是随便舒了一下情，你就这么婆婆妈妈、唧唧歪歪、罗里罗唆，你还想
		不想混了？",
        "沙僧：好了好了，大家都是出来给观音如来打工的，何必呢？ ",
        "唐僧：我和你大师兄说话什么时候轮到你插嘴了？为了扳你这个毛病，我已经把你大师兄的金箍
		戴在了你头上，你又来！",
        "沙僧：ok！我闭嘴先！ ",
        "唐僧：八戒，为师的又该说说你了。虽然你最近减肥有些成效，虽然沙僧不喜欢和别人争辩，可你
		就看在他肩上挑着行李的份上……你就别这样了。 ",
        "八戒：我这也是为了大家好啊！我老猪一走路就容易饿，就免不了让大家去化斋，就免不了耽误了取经的时日。",
        "唐僧：那是我错怪你了，你就继续在你师弟脖子上骑着吧？",
        "沙僧：#￥@$^唐僧：悟空，让他这么一说，我还真有些饿了，就劳烦你走一趟吧！ ",
        "悟空：又是我？轮也轮到你去了吧？ ",
		 "唐僧：从理论上来讲，我应该去化斋的，可人家这两天……不太方便…… 
		 （集体晕倒） ",
        (: give_gift :),
});

void create()
{

        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

int give_gift()
{
         STORY_D->give_gift("/d/obj/story/shenliwan", 1,
                           HIM "\n“啪”的一声一枚神力丸掉到你面前。\n\n" NOR);
        return 0;
}

