// story:xiao&li

#include <ansi.h>

private mixed *story = ({
        "罗煞鬼婆：李……逍……遥……，李……逍……遥……！",
        "鬼婆的魔音，有如破锣铜鼓，在李逍遥耳际隆隆作响;顷刻跌落地面痛彻心脾。",
        "李逍遥破口大骂：作恶多端的罗煞鬼婆，既然落在你的手里，要杀要剐不用多说！",
        "罗煞鬼婆怒骂道：可恶！",
        "罗煞鬼婆以独门怪兵器骷髅锤朝李逍遥脑门击落",
        "李逍遥无力闪躲，天庭吃了一记，只觉天旋地转，头脑发胀。",
        "李大娘：李逍遥！你找死啊？敢说老娘是什么鬼婆！”",
        "李大娘：又在做白日梦了！你也不小了，整天疯疯癫癫的，也不做正经事！",
        "李逍遥：婶婶你不要每次叫我起床，都用锅啊、铲的胡敲一通，吓死人了！",
        "李逍遥：再说我们的床又不牢靠，不小心就掉到床下头了。",
        "李大娘：每天睡到日上三竿，不这样叫得醒你吗？",
        "李大娘：好歹你也跟林木匠学过几个月，只会削些木刀木剑！床不牢靠，自己动手修\n修就好了，就想学你爹舞刀弄枪，没个定性，有哪家姑娘愿意嫁给你？",
        "李逍遥：那我爹又怎能娶到我娘？",
        "李大娘：说起来真是羞死人了，自己跑上门来，说非你爹不嫁。过了我们李家的门，也\n不做些针线女红，就会跟你爹疯！",
        "李逍遥：他们可是江湖上人见人羡的鸳鸯侠侣啊！",
        "李大娘：是呀！说什么去行侠仗义，丢下你这个惹祸精，一去十多年没有消息。",
        "李逍遥：所以我要练成绝世武功，去找我爹娘。",
        "李大娘：我后半辈子全指望你了，你哪都别想去！",
        "李逍遥：男儿志在四方，呆在这里能有啥出息？",
   "李大娘：你游手好闲是出了名的，要不是婶婶忙不过来，才不指望你这个懒\n鬼来帮忙呢！赶紧去把上房收拾干净，我要下楼招呼客人了。",
        "李逍遥：#%^$*@*%,怎么这么早就有客人来...哎！",
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}


