// story:laojun 西游

#include <ansi.h>

int give_gift();

private mixed *story = ({
        "“李逍遥！你找死啊？敢说老娘是什么鬼婆！”",
        "李逍遥强睁双眼，定神一看，只见婶婶左手持锅，右手拿铲，怒气不息的指着李逍遥",
        "李大娘:又在做白日梦了！你也不小了，整天疯疯癫癫的，也不做正经事!",
        "李逍遥揉眼抱怨道:婶婶你不要每次叫我起床，都用锅啊、铲的胡敲一通，吓死人了！我们的床又不牢靠，不小心就掉到床下头了。",
        "李大娘:每天睡到日上三竿，不这样叫得醒你吗？好歹你也跟林木匠学过几个月，只会削些木刀木剑！",
        "李大娘:床不牢靠，自己动手修修就好了，就想学你爹舞刀弄枪，没个定性，有哪家姑娘愿意嫁给你？",
        "李逍遥:那我爹又怎能娶到我娘?",
        "李大娘:说起来真是羞死人了，自己跑上门来，说非你爹不嫁。过了我们李家的门，也不做些针线女红，就会跟你爹疯！",
        "李大娘:快起来，拿这些钱去买些菜回来。",
        "李逍遥:知道啦!!!",
        "李逍遥接过钱随手往口袋里一放，没想到口袋是个破的....." ,
        (: give_gift :),
        "李逍遥:我走了!",
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

int give_gift()
{
        STORY_D->give_gift("/obj/money/gold", 3,
                           HIM "\n“啪”的一声一些黄金掉到你面前。\n\n" NOR);
        return 1;
}

