#include <ansi.h>

inherit ITEM;

void create()
{
        set_name(HIW"名册"NOR, ({"ming ce","ce"}));
        set_weight(100);
        if( clonep() )
                set_default_object(__FILE__);
        else {
                set("unit", "本");
                set("long",
"                       基本武学书籍名册                \n"
"\n"

"     〖刀法入门〗　：　　　　　　　　　长安城中（有售）\n" 
"     〖拳法入门〗　：　　　　　　　　　长安城中（有售）\n" 
"     〖道德经〗　　：曾出现于车迟国，据说方寸山也有收藏\n" 
"     〖伏魔山心经〗：据说欲得此书，需梦中求根，使其花落\n" 
"     　　　　　　　　熬来，则终可得其所愿！　　　　　　\n" 
"     〖女儿经〗　　：　　　　　　　　　　　　　藏于月宫\n" 
"     〖青莲剑谱〗　：　　　曾有人看见诗仙以此书换得好酒\n" 
"     〖金刚经〗　　：　　　　　　　　　　　　　藏于普陀\n" 
"     〖旧书〗　　　：　　　　　　　　　　　藏于长安城东\n" 
"     〖无字天书〗　：　　　欲得此物需找长安城西算命先生\n" 
"     〖格斗秘诀〗　：　　　　　　　　找高老庄的土匪头子\n" 
"     〖千字文〗　　：　　　　　　　　方寸山道长藏有此书\n" 
"     〖拳经〗　　　：　　　　　　　　　　　　长安城武馆\n" 
"     〖三字经〗　　：　　　　　　　　　长安城中（有售）\n" 
"     〖枪法简介〗　：　　　　　　　　　　　大唐将军府中\n" 
"     〖杖法简要〗　：　　　　　　　　　　　　　藏于普陀\n" 
"     〖风水〗　　　：　据说有人在熬来国一老妇人家中见到\n" 
"     　碎布头　　　：　　　　　　　　　　方寸山道长藏有\n" 

"\n\n"
"                                             顺风耳查实\n");
                set("material", "paper");
        }
  set("is_monitored",1);
  setup();
}
