［朱紫国］

                                    ※小西天※
                                   ／
                               林中路
                                   ＼
     ※盘丝岭※                   林中路
           ＼                       ｜
          林中路                  林中路
               ＼                  ／
                林中路－林中路－大路 
                                 ｜
                                大路
                                 ｜  
                               朱紫门
                                 ｜  
                               朱紫街
                                 ｜
        北霞街－北霞街－北霞街－街口－北霞街－北霞街－北霞街 
                  ｜             ｜                     ｜          
         酒店    茶房    面馆－朱紫街  药铺   斗蟋馆   马栈       ※麒麟山※ 
          ｜      ｜      ｜     ｜     ｜      ｜      ｜          ／
夕林门－夕林街－夕林街－夕林街－鼓楼－天阳街－天阳街－天阳街－天阳门
          ｜      ｜      ｜     ｜             ｜                      
         饭楼    米铺   杂货店 朱紫街         会同馆－厨房
                                 ｜             ｜
                               朱紫街－兵营    厢房
                                 ｜
                  －－护宫河－－宫门－－护宫河－－
                                 ｜
                                前宫
                              ／ ｜
                        御花园－正宫－内院－内宫
                                 ｜      ＼／
                                昭阳宫－后三宫 


[雪豹1997.11]
