［通天河／陈家庄］


                                                                
※金兜山※                                                      
    －小路  河西                                                
          ＼ ｜                                                  
            河西              河东            民居  民居  民居  
             ｜                ｜              ｜     ＼ ／     
            河西－冰道－冰道－河东      民居－陈家庄－陈家庄        
             ｜    ｜    ｜    ｜              ｜           ＼   ※车迟国※
            河西－冰道－冰道－河东      小路－陈家庄－民居    小路／
             ｜                ｜     ／        ＼             
            河西              河东－小路           民居        
             ｜                ｜                               
            河西              河东                              
                               ｜                               
                              河东                              
                                                                
                                                                

[雪豹1997.12]

