［天竺国］

                      花铺             竹器店
                       ｜                ｜
          街道－街道－街道－街道－街道－街道－街道－街道－私塾
           ｜    ｜                                  ｜
    客店－街道－酒馆        ※※※※※      布道场－街道
           ｜               ※皇  宫※               ｜
          街道－药房        ※※※※※      光禄寺－街道
           ｜                   ｜                   ｜
    马房－街道        书局     街道                 街道
           ｜          ｜       ｜                   ｜
  －大路－西门－街道－街道－十字街彩楼－街道－街道－东门－大路
※灵山※   ｜                   ｜       ｜          ｜       ＼
          街道－卦签铺 瓜果店－街道     钱庄  帽店－街道       山冈
           ｜                   ｜                   ｜         ｜
    酱房－街道       蔬菜市场－街道－肉铺     鞋店－街道       鸡鸣关
           ｜                   ｜                   ｜            ＼
    水站－街道  皮店           街道    成衣店 布店  街道           山冈
           ｜    ｜           ／  ＼     ｜    ｜    ｜               ＼
          街道－街道－街道－街道  街道－街道－街道－街道               山冈
           ｜          ｜     ＼  ／     ｜                             ｜
         小吃店      首饰店    南门     当铺             ※※※※※※  山冈
                                ｜                       ※布金禅寺※／ ｜ 
                               大路                      ※※※※※※  山冈
                                ｜                                       ＼
                               大路                                   ※金平府※
                                ｜  
                               大路
                                ｜  
                            ※毛颖山※

［皇宫］
                   
                   后宫－后宫－后宫－后宫－后宫
                          ｜    ｜    ｜
                        龙阁－御花园－凤亭
                                ｜
                              金銮殿
                                ｜
                              昭阳宫－宫院－华夷阁
                                ｜
                               午门
                                ｜

［布金禅寺］
                                                ／
                                         百脚山麓
                                        ／
                                      山门
                                       ｜
                          方丈－宝殿－寺院
                                    ＼ ｜
                                      后院
                                       ｜ ＼
                                      斋房  禅房


[雪豹1997.12]

