［平顶山／压龙山］

                                 平顶山                                     
                                 ／  ＼                                      
                             平顶山   平顶山  ※※※※※ 
                           ／  ｜  ＼   ｜  ＼※莲花洞※
                  山道→山道  山道  平顶山    ※※※※※
                ／              ＼                     
            山道                  山道                 
          ／                     ／                   
 ※乌鸡国※                    山道                   
                                 ＼                  
                                  山道                       ※宝象国※ 
                                   ｜                       ／               
                                  山道←山道←山道       山道
                                  ／              ＼    ／                   
                               山道                 山道                  
                                ↓                                        
                              乌林子                                     
                                ＼                                      
                                乌林子                                     
                              ／
                          山道                                       
                        ／                                              
                       压龙山                                            
                        ↓   ＼                                          
                      压龙山←压龙山                                     
                      ／                                     
                   ※※※※※                                            
                   ※压龙洞※                                            
                   ※※※※※


［莲花洞］

             ＼
               洞外      北洞
                  ＼    ／ 
                    洞门－前厅－大厅
                     ｜
                    南洞
                    

［压龙洞］
                        ／ 
                      石门
                         ＼
                           石廊
                            ｜
                           石廊
                          ／
                        内殿－卧房
                      ／   
                    卧房

[雪豹1997.12]

