£ÛÒþÎíÉ½£Ý

            ÐüÑÂ£­£­ÐüÑÂ
          £¯          ¡ü       ÐüÑÂ£­£­ÐüÑÂ
         £¯          ÐüÑÂ    £¯            £Ü
       ÐüÑÂ            £Ü   £¯               ÐüÑÂ 
        ¡ü      ²ÝÆÂ£­£­Â·¿Ú                  ¡ü            
        ¡ü       £Ü    £¯   £Ü                ½§¿Ú
       ÐüÑÂ        £Ü £¯      ²ÝÆÂ           ¡«  ¡«                      
         ¡«       ²ÝÆÂ           £Ü            ½§¿Ú
           ¡«    £¯                 ²ÝÆÂ       £¯
             ²ÝÆÂ                       £Ü    £¯  
             ¡«                           »ÄÒ°   
                 ¡«                     £¯    £Ü
            »ÄÒ°£­£­»ÄÒ°£­£­»ÄÒ°£­£­»ÄÒ°        »ÄÒ°£­£­»ÄÒ°£­£­
          £¯                                   £¯            ¡ùÇÕ·¨¹ú¡ù
        £¯                                  »ÄÒ°
    ¡ù·ïÏÉ¿¤¡ù                                  £Ü
                                                 Ã©ÎÝ         
£ÛÁ¬»·¶´£Ý

            É½ÃÅ               ºóÔ°
                £Ü              £ü
                  Æ«ÌÃ£­ÖÐÌÃ£­°þÆ¤Í¤£­Ìì¾®
                                  £Ü
                                    Èâ¿â

[Ñ©±ª1997.12]
