//Cracked by Roath
inherit ROOM;
void create()
{
  set ("short", "╟Эвс╣Ц");
  set ("long", @LONG

    уБ╪р╟Эвс╣Й╣диЗрБ╠╬ю╢йг╨эюДгЕ╣дё╛вт╢ск╣лЛ╫Р║╟╧╥╡╩юМ║╠╟Эвсдк
лЛоб╣зр╩╟Эвсё╛сзйг╣Йюо╟Еуеп║╤Ч╠Цмпхкк╣гИтз╫╜жщ©╙акр╩╪р╥ж╨её╛╢с
╢куБ╪р╟Эвс╣Й╠Д╣ццем╔хТйп║ё
[1;33m
                 ║Ы║Ы║Ы║Ы║Ы║Ы║Ы║Ы║Ы║Ы║Ы║Ы║Ы
                 ║Ы                      ║Ы
                 ║Ы    [32mуЩвзлЛ╫Р╧╥╡╩юМ   [33m ║Ы
                 ║Ы                      ║Ы
                 ║Ы║Ы║Ы║Ы║Ы║Ы║Ы║Ы║Ы║Ы║Ы║Ы║Ы[m
LONG);
  set("exits", ([ /* sizeof() == 1 */
  "west" : __DIR__"xw-1",
]));
  set("objects",([
        __DIR__"npc/wang2":1,
                ]));
        set("no_fight", 1);
  setup();
}
