// monkey1.c

inherit NPC;

void create()
{
	set_name("ºï×Ó", ({ "hou zi","monkey","hou" }) );
	set("race", "Ò°ÊŞ");
	set("age", 8);
	set("long", "Ò»Ö»ÍçÆ¤µÄĞ¡ºï×Ó¡£\n");
	
	set("str", 30);
	set("cor", 26);	
	set("combat_exp", 50);
  set("daoxing", 0);

  

            set_skill("dodge",20);
            set_skill("unarmed",10);
	set("limbs", ({ "Í·²¿", "ÉíÌå", "Ç°×¦", "ºó½Å", "Î²°Í" }) );
	set("verbs", ({ "bite", "claw" }) );

	set("chat_chance", 3);
	set("chat_msg", ({
		"Ğ¡ºï×ÓÏòÆÙ²¼ÏÂÕÅÍûÁËÒ»ÏÂ¡£\n",
		"ºï×ÓÃÇ½»Í·½á¶úµÀ£º£¢²»ÖªÕâÆÙ²¼ÏÂÊÇ·¬Ê²Ã´·ç¾°¡££¢\n",
		"ºï×ÓÃÇµÀ£º¡°ÄÇÒ»¸öÓĞ±¾ÊÂµÄ£¬×ê½øÈ¥Ñ°¸öÔ´Í·³öÀ´£¬²»ÉËÉíÌåÕß£¬ÎÒµÈ¼´°İËûÎªÍõ¡£¡±\n",
		"ÖÚºïÅÄÊÖ³ÆÑïµÀ£º¡°ºÃË®£¡ºÃË®£¡Ô­À´´Ë´¦Ô¶Í¨É½½ÅÖ®ÏÂ£¬Ö±½Ó´óº£Ö®²¨¡££¢\n" }) );
		

	setup();
}


ÿÿ