//Cracked by Roath
inherit ITEM;

void create()
{
  set_name("〖东海仙山图〗", ({ "eastsea map","map" }) );
  set_weight(10);
		set("value", 500);

  setup();
  set("unit", "张");
  set("long", @LONG
				〖东海仙山图〗

			
		钱塘  	\	 _/\_
			/	( 北 )
			|       /____\ 
		       /          ||
		      /   ※※※※
         	     |	  ※蓬莱※
			  ※※※※         ※※※※			
 					   ※方丈※
			※※※※	   ※※※※
			※瀛洲※
			※※※※

〖蓬莱〗
	大地仙乡列圣曹，蓬莱分合镇波涛。瑶台冷蘸天心冷，巨阙光浮海面高。
	五色烟霞含玉籁，九宵星月射金鳌。西池王母长来此，奉献三仙几次桃。

记：余于七月初七过蓬莱，幸见三老及分赏碧藕，火枣，交梨。

〖方丈〗
	方丈巍峨别是天，太元宫府会神仙。紫台光照三清路，花木香浮五色烟。
	金凤自多磐心阕，玉膏谁逼灌芝田。碧桃紫李新成熟，又换仙人信万年。

〖瀛洲〗
	珠树玲珑照紫烟，瀛洲宫阙接诸天。青山绿水淇花艳，玉液锟吾铁石坚。
	五色碧鸡啼海日，千年丹凤吸朱烟。世人罔究壶中景，象外春光亿万年。

LONG
  );
  set("realmap",1);
  setup();
}

void init()
{
}

