string *qijian_msg = ({
//盘庚
HIC"\n忽见$N左手小指一伸，一条气流从$P少冲穴中激射而出，「盘庚剑」指向身前$n！\n"NOR,
HIC"$N左斜行三步，左手小指的内力自左向右的斜攻过去，「盘庚剑」直插$n$l！\n"NOR,
HIC"\n$N手臂陡然一提，在手掌离$n不到一尺之处，立即变掌为指！\n"NOR,
//毕命
HIC"\n$N长笑一声，俯身斜倚，无名指弹出，指尖已对准$n的$l发出了一缕强烈的劲风！\n"NOR,
HIC"\n$N无名指一挥，拙滞古朴的毕命剑气直射而出，端端正正地刺向$n！\n"NOR,
//罔命
HIC"\n$N变招奇速，右手食指如毒蛇出洞，疾从袖底穿出，大喝一声，双手幻出无数指影！\n"NOR,
HIC"\n$N拇指一屈，食指点出，变成了「罔命剑」，一缕剑气向$n刺出！\n"NOR,
HIC"\n$N食指连动，「罔命剑」一剑又一剑的刺出，其轻灵迅速，快速无比！\n"NOR,
HIC"\n$N以食指运那无形剑气，却不过是手指在数寸范围内转动，对着$n一点一戳！\n"NOR,
//至诚
HIC"\n$N中指一竖，一式「至诚剑」向前刺出！\n"NOR,
HIC"\n$N将中指向上一炭，「至诚剑」拔地而起，接着$P将手指向下一划，剑气如利刀般砍向$n！\n"NOR,
HIC"\n电光火石之间，$N一翻掌，身向右移，奋起神威，右手斗然探出，中指向$n一竖！\n"NOR,
//瞽蒙
HIC"\n$N掌托于胸前，伸出右小指，一招「瞽蒙剑」缓缓地点向$n的周身大穴，弹指无声！\n"NOR,
HIC"\n$N小指一弹，使一招「瞽蒙剑」，剑势如同柳絮一般，飘而不乱！\n"NOR,
HIC"\n$N一招「瞽蒙剑」，剑气回转，竟从左侧绕了过来，点向$n的$l！\n"NOR,
HIC"\n$N右手小指一挥，一招「瞽蒙剑」点点刺刺，宛如雕花刺画一般！\n"NOR,
//止戢
HIC"\n$N大拇指一按，嗤嗤两指，劲道使得甚巧，初缓后急，剑气如怒潮般汹涌而至！\n"NOR,
HIC"\n$N大拇指连挥，「止戢剑」便如是一幅泼墨山水相似，纵横倚斜，寥寥数笔，却是剑路雄劲！\n"NOR,
HIC"\n$N的「止戢剑」大开大阖，气派宏伟，每一剑刺出，都有石破天惊、风雨大至之势！\n"NOR,
});
string *target_msg = ({
//盘庚
"你只觉得一股无形剑气向你的$l激射而来，其变化精微，快绝无比！\n",
"那一股无形剑气当真是忽来忽去，变化精微，让你避无可避！\n",
//毕命
"你感觉到那无形剑气拙滞古朴，奇正有别，委实难以架挡！\n",
"所谓“大巧不工”，那直冲而来的无形剑气竟然使你无从躲避！\n",
//罔命
"那无形的剑气巧妙灵活，难以琢磨，幻化间直奔你而来！\n",
"无论你变招多快，也及不上那一缕剑气，瞬间已逼到了你跟前！\n",
//至诚
"你感到这一股迅疾而来的的中冲剑气大开大合，气势雄伟，根本挡无可挡！\n",
"猛然间你感到周身大穴都被一股大开大合，气势雄伟的无形剑气所包围！\n",
//瞽蒙
"待那剑气到得近前，竟是劲气弥漫，破空之声甚厉！\n",
"只见那刺来的无形剑气‘拙’而不缓，‘缓’而不弱，有如神剑！\n",
//止戢
"只见那剑路雄劲，石破天惊，逼得你左躲右闪，无法招架！\n",
"你见那无形剑气颇有石破天惊、风雨大至之势，逼得你纵高伏低，东闪西避！\n"NOR,
});

string *winner_msg = ({
	CYN "\n$N哈哈大笑，说道：承让了！\n\n" NOR,
	CYN "\n$N双手一拱，笑着说道：承让！\n\n" NOR,
        CYN "\n$n向后一纵，说道：阁下武艺果然高明，这场算是在下输了！\n\n" NOR,
	CYN "\n$N胜了这招，向后跃开三尺，笑道：承让！\n\n" NOR,
	CYN "\n$n脸色微变，说道：佩服，佩服！\n\n" NOR,
	CYN "\n$n向后退了几步，说道：这场比试算我输了，佩服，佩服！\n\n" NOR,
	CYN "\n$n向后一纵，躬身做揖说道：阁下武艺不凡，果然高明！\n\n" NOR,
});

string *winner_animal_msg = ({
	CYN "\n$N退在一旁，警戒地向$n盯视！\n\n" NOR,
	CYN "\n$N退守开来，但仍然毫不放松地盯着$n！\n\n" NOR,
	CYN "\n$N退了几步，但随时可能再冲过来！\n\n" NOR
});
